src/tests/performancetest/http-perf-test.yml
config:
  target: "http://104.248.254.222"
  phases:
  - duration: 20
    arrivalRate: 10
scenarios:
  - name: "Send text editing"
    flow:
      - get:
          url: "/"
      - post:
          url: "/editor/editText"
          headers:
            Content-Type: "application/json"
          body: >
            {"action":"insert","positionStart":{"row":0,"column":1},"content":["y\n"],"positionEnd":{"row":1,"column":0}}
      - get:
          url: "/editor/getText/longPolling"