src/tests/performancetest/http-perf-test.yml
config:
  target: "http://localhost"
  phases:
  - duration: 20
    arrivalRate: 10
scenarios:
- name: "Send text editing"
  flow:
  - get:
      url: "/"
  - loop:
    - post:
        url: "/editor/editText"
        headers:
          Content-Type: "application/json"
        body: >
              {"action":"insert","positionStart":{"row":0,"column":0},"content":["y\n"],"positionEnd":{"row":0,"column":1}}
      think: 2
    count: 10